In [1]:
import numpy as np
import pandas as pd

# Deleting Data

In [12]:
cities = pd.DataFrame(np.arange(16).reshape(4, 4),
                     index = ['Sukkhar', 'Rawalpindi', 'Peshawar', 'Multan'],
                     columns = ['A', 'C', 'D', 'E'])
cities

             A   C   D   E
Sukkhar      0   1   2   3
Rawalpindi   4   5   6   7
Peshawar     8   9  10  11
Multan      12  13  14  15

In [13]:
# dataframe.drop method would return a new dataframe without having deleted rows. So, Store it into dataframe variable or use
# inplace=True while, dropping row and columns
#rows is axis 0 and columns is axis 1
cities.drop('A', axis=1, inplace=True)  #run one time only, because A is already deleted and save into 'cities'
cities

             C   D   E
Sukkhar      1   2   3
Rawalpindi   5   6   7
Peshawar     9  10  11
Multan      13  14  15

In [15]:
cities_one = pd.DataFrame(np.arange(16).reshape(4, 4),
                     index = ['Sukkhar', 'Rawalpindi', 'Peshawar', 'Multan'],
                     columns = ['A', 'C', 'D', 'E'])
cities_one

             A   C   D   E
Sukkhar      0   1   2   3
Rawalpindi   4   5   6   7
Peshawar     8   9  10  11
Multan      12  13  14  15

In [17]:
#you can remaining rows and columns of the dataframe
cities_del = cities_one.drop('A', axis=1)
cities_del

             C   D   E
Sukkhar      1   2   3
Rawalpindi   5   6   7
Peshawar     9  10  11
Multan      13  14  15

In [21]:
#If I wanna remove row from my dataframe, than you can only change axis form '1' to '0' or working without axis 
#here, row 'Multan' deleted but can't be save as we don't store this process on any variable
cities.drop('Multan', axis=0)

            C   D   E
Sukkhar     1   2   3
Rawalpindi  5   6   7
Peshawar    9  10  11

# Indexing, Selection & Filtering

In [23]:
#Creating New Dataframe
countries = pd.DataFrame(np.arange(16).reshape(4, 4),
                     index = ['Pakistan', 'India', 'Bangladesh', 'China'],
                     columns = ['A', 'B', 'C', 'D'])
countries

             A   B   C   D
Pakistan     0   1   2   3
India        4   5   6   7
Bangladesh   8   9  10  11
China       12  13  14  15

In [26]:
#If you wanna print any particular column than, slicing it by '[]' brackets
#But still can't save on 'countries'
#unless we can store it into an variable
countries_two_columns = countries[['A', 'D']]
countries_two_columns
#advantage of creating new dataframe by previous dataframe is we use it for different purposes

             A   D
Pakistan     0   3
India        4   7
Bangladesh   8  11
China       12  15

In [29]:
#if you wanna prints some particular rows than,
countries[2:]  #print last two rows only, starting 2 to onwards

             A   B   C   D
Bangladesh   8   9  10  11
China       12  13  14  15